{ "posts": [{
    "author": "Fox Mulder",
    "content": "The Flukeman originated on a decommissioned Russian freighter, used in the disposal of salvage material from the nuclear meltdown at Chernobyl. The creature was thus born in a primordial soup of radioactive sewage. In the Atlantic Ocean, two miles off the coast of New Jersey, the Flukeman caused a blockage in the freighter's boiler system. The being then attacked a young engineer named Dmitri who had been sent to clear the blockage, dragging him down into murky water inside one of the freighter's sewage tanks despite the efforts of his crewmates to keep him grounded. When the crew members flushed the tanks, the Flukeman was washed out to sea, along with Dmitri's body. This incident was later reported in the National Comet, in which the creature was referred to – in an article titled \"Monster On Board?!\" – as a \"modern day sea monster, a bloodthirsty creature from beneath the waves.\"",
    "title": "Flukeman - Creation and First Killings",
    "category": "Solved",
    "image": "http://orig05.deviantart.net/54d2/f/2011/092/1/9/flukeman_by_striffle-d3d2klc.jpg"
  }, {
    "author": "Fox Mulder",
    "content": "The Tamam Shud case, also known as the Mystery of the Somerton Man, is an unsolved case of an unidentified man found dead at 6:30 am, 1 December 1948, on Somerton beach, Glenelg, just south of Adelaide, South Australia. It is named after a phrase, tamám shud, meaning \"ended\" or \"finished\" in Persian, printed on a scrap of paper found months later in the fob pocket of the man's trousers. This scrap had been torn from the final page of a copy of Rubaiyat of Omar Khayyam – a collection of poems attributed to the 12th Century poet Omar Khayyám. In some early reports of the case, Tamam was misspelt Taman, and the error has often been repeated.",
    "title": "Mystery of the Somerton Man",
    "category": "Unsolved",
    "image": "https://upload.wikimedia.org/wikipedia/commons/7/77/SomertonManCode.jpg"
  }, {
    "author": "Fox Mulder",
    "content": "From a historical standpoint Democrats are twice as likely to die in air crashes as Republicans. Frequently, those who have died were known to have been either involved in the investigation of covert operations or to have taken highly controversial positions in opposition to vested government interests. Sam Smith of the Progressive Review (www.prorev.com) published an Oct. 25 story titled \"Politicians Killed In Plane Crashes.\" For his source he used a wonderful database found at http://politicalgraveyard.com. Of 22 air crashes involving state and federal officials, including one ambassador (Arnold Raphael) and one cabinet official (Ron Brown), FTW found that 14 (64 percent) were members of the Democratic Party and 8 (36 percent) were members of the Republican Party. If the list was limited to only elected members of Congress, the total was eight Democrats and four Republicans. Six of the fatalities occurred during election campaigns. Of those, four were Democrats and two were Republicans. Maybe Democrats can't afford the same type of planes that Republicans can. That certainly was not the case with Paul Wellstone who was killed in a Beechcraft King Air 100, twin turboprop. The King Air is a favorite of many politicians and is widely regarded as the \"Cadillac\" of twin-engined propeller driven airplanes. The state of Minnesota owns two of them. And as FTW reported in October 1999, a Beechcraft King Air owned by the state of Texas was a personal favorite of then-Gov. George W. Bush. That particular King Air had a sordid past however. It had previously been owned by the legendary drug smuggler Barry Seal. (The Associated Press picked up our story of the plane's history).",
    "title": "Was Paul Wellstone Murdered?",
    "category": "Unsolved",
    "image": "https://upload.wikimedia.org/wikipedia/commons/7/77/SomertonManCode.jpg"
  }]
}
